# Groupby 

A groupby operation involves some combination of splitting the
object, applying a function, and combining the results. This can be
used to group large amounts of data and compute operations on these
groups.

Refs: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html

In [1]:
import pandas as pd

In [2]:
data = {'Department':['CS&IS','CS&IS','Biology','Biology','English','English'],
        'Cohort': ['Undergraduate','Graduate','Undergraduate','Graduate','Undergraduate','Graduate'],
        'Student':[300, 150,100, 70, 120,60]
    
}
data

{'Department': ['CS&IS', 'CS&IS', 'Biology', 'Biology', 'English', 'English'],
 'Cohort': ['Undergraduate',
  'Graduate',
  'Undergraduate',
  'Graduate',
  'Undergraduate',
  'Graduate'],
 'Student': [300, 150, 100, 70, 120, 60]}

In [3]:
df = pd.DataFrame(data)
df

  Department         Cohort  Student
0      CS&IS  Undergraduate      300
1      CS&IS       Graduate      150
2    Biology  Undergraduate      100
3    Biology       Graduate       70
4    English  Undergraduate      120
5    English       Graduate       60

In [4]:
#Use groupby method to group rows together based on column 'Department' 
df_by_dept = df.groupby('Department')
df_by_dept

In [5]:
df_by_dept.mean()

            Student
Department
Biology          85
CS&IS           225
English          90

In [6]:
df_by_dept.std()

               Student
Department
Biology      21.213203
CS&IS       106.066017
English      42.426407

In [7]:
df_by_dept.min()

              Cohort  Student
Department
Biology     Graduate       70
CS&IS       Graduate      150
English     Graduate       60

In [8]:
df_by_dept.max()

                   Cohort  Student
Department
Biology     Undergraduate      100
CS&IS       Undergraduate      300
English     Undergraduate      120

In [9]:
df_by_dept.count()

            Cohort  Student
Department
Biology          2        2
CS&IS            2        2
English          2        2

In [10]:
#describe() method shows all stats
df_by_dept.describe()

           Student
             count   mean         std    min    25%    50%    75%    max
Department
Biology        2.0   85.0   21.213203   70.0   77.5   85.0   92.5  100.0
CS&IS          2.0  225.0  106.066017  150.0  187.5  225.0  262.5  300.0
English        2.0   90.0   42.426407   60.0   75.0   90.0  105.0  120.0

In [11]:
df_by_dept.describe().transpose()

Department        Biology       CS&IS     English
Student count    2.000000    2.000000    2.000000
        mean    85.000000  225.000000   90.000000
        std     21.213203  106.066017   42.426407
        min     70.000000  150.000000   60.000000
        25%     77.500000  187.500000   75.000000
        50%     85.000000  225.000000   90.000000
        75%     92.500000  262.500000  105.000000
        max    100.000000  300.000000  120.000000

In [12]:
#To see only CS&IS information 
df_by_dept.describe().transpose()['CS&IS']

Student  count      2.000000
         mean     225.000000
         std      106.066017
         min      150.000000
         25%      187.500000
         50%      225.000000
         75%      262.500000
         max      300.000000
Name: CS&IS, dtype: float64

### Exercise group by cohort

In [13]:
df_by_cohort = df.groupby('Cohort')

In [14]:
df_by_cohort.describe()

              Student                                                      \
                count        mean         std    min    25%    50%    75%
Cohort
Graduate          3.0   93.333333   49.328829   60.0   65.0   70.0  110.0
Undergraduate     3.0  173.333333  110.151411  100.0  110.0  120.0  210.0


                 max
Cohort
Graduate       150.0
Undergraduate  300.0

In [15]:
df_by_cohort.sum()

               Student
Cohort
Graduate           280
Undergraduate      520